In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b', 'c']
data = [1,2,3]
my_ar = np.array(data)

In [4]:
ser1 = pd.Series(labels)
ser2 = pd.Series(data = data, index = labels)
ser3 = pd.Series(labels)
print(ser1)
print(ser2)
print(ser3)

0    a
1    b
2    c
dtype: object
a    1
b    2
c    3
dtype: int64
0    a
1    b
2    c
dtype: object

In [5]:
np.random.seed(101)

In [11]:
from numpy.random import randn
df = pd.DataFrame(randn(5,4),index = ['A', 'B', 'C', 'D', 'E'], columns=['W', 'X', 'Y', 'Z'])

In [12]:
print(df)

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [16]:
df['new'] = df['W'] + df['Y']

In [17]:
df

          W         X         Y         Z       new
A  0.386030  2.084019 -0.376519  0.230336  0.009512
B  0.681209  1.035125 -0.031160  1.939932  0.650049
C -1.005187 -0.741790  0.187125 -0.732845 -0.818062
D -1.382920  1.482495  0.961458 -2.141212 -0.421462
E  0.992573  1.192241 -1.046780  1.292765 -0.054206

In [22]:
df.shape

(5, 5)

In [23]:
df.drop('new', axis = 1, inplace = True)

In [24]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [27]:
df[['W','Y']] #Selecting multiple columns from a dataframe

          W         Y
A  0.386030 -0.376519
B  0.681209 -0.031160
C -1.005187  0.187125
D -1.382920  0.961458
E  0.992573 -1.046780

In [30]:
#Selecting rows
df.loc['A']

W    0.386030
X    2.084019
Y   -0.376519
Z    0.230336
Name: A, dtype: float64

In [31]:
df.iloc[2]

W   -1.005187
X   -0.741790
Y    0.187125
Z   -0.732845
Name: C, dtype: float64

In [33]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  0.386030 -0.376519
B  0.681209 -0.031160

In [35]:
df[df>0]

          W         X         Y         Z
A  0.386030  2.084019       NaN  0.230336
B  0.681209  1.035125       NaN  1.939932
C       NaN       NaN  0.187125       NaN
D       NaN  1.482495  0.961458       NaN
E  0.992573  1.192241       NaN  1.292765

In [37]:
df[df['W']>0]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
E  0.992573  1.192241 -1.046780  1.292765

In [39]:
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [45]:
df[df['W'] > 0][['Y', 'X']]

          Y         X
A -0.376519  2.084019
B -0.031160  1.035125
E -1.046780  1.192241

In [41]:
df[(df['W'] > 0) & (df['Y']>-1)]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932

In [46]:
df[(df['W'] > 0) | (df['Y']>-1)]

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [48]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
data_df = pd.DataFrame(data)
data_df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [50]:
by_com = data_df.groupby('Company')

In [52]:
by_com.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [53]:
by_com.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [54]:
by_com.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [57]:
by_com.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [14]:
#create a df from scratch
a_df = pd.DataFrame(data = randn(5,3),index = ['A','B', 'C', 'D', 'E'], columns = ['X', 'Y', 'Z'])

In [15]:
a_df

          X         Y         Z
A  0.692117  1.351629  1.069762
B -0.614527  0.332860 -1.158055
C -0.495171  0.592035  0.812001
D  1.303383 -1.579666  1.658472
E  1.841626 -0.093037 -1.773738

In [16]:
a_df[a_df['X']>0][['Y']]

          Y
A  1.351629
D -1.579666
E -0.093037

In [17]:
a_df['W'] = 'USA USA USA IND IND '.split()

In [24]:
by_coun = a_df[['W','X']].groupby('W')

In [25]:
by_coun.mean()

            X
W
IND  1.572504
USA -0.139194

In [26]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [28]:
a_df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')